import { ESolarSystemObject } from '../enums/object.enum';

export const OBJECTS_SMALL_DESCRIPTIONS = {
  [ESolarSystemObject.SUN]:
    'Солнце - центральное тело нашей Солнечной системы. Это звезда, состоящая в основном из водорода и гелия, которые под воздействием термоядерных реакций преобразуются в энергию и свет. Солнце обладает мощным гравитационным полем, удерживающим планеты и другие объекты вокруг себя. Благодаря Солнцу мы получаем свет и тепло, необходимые для жизни на Земле.',
  [ESolarSystemObject.MERCURY]:
    'Меркурий - ближайшая к Солнцу планета в нашей Солнечной системе и самая маленькая среди планет внутренней группы. Его поверхность напоминает Луну: она покрыта кратерами и рифтами, из-за чего Меркурий выглядит как высушенная и разоренная планета. Из-за близости к Солнцу температуры на Меркурии могут достигать до 430 градусов Цельсия в дневное время и падать до -180 градусов Цельсия ночью.',
  [ESolarSystemObject.VENUS]:
    'Венера - вторая планета от Солнца и самая яркая планета на небе после Луны. Она часто называется "утренней звездой" или "вечерней звездой" из-за ее яркости. Венера имеет очень плотную атмосферу, состоящую преимущественно из углекислого газа, сильно препятствующую видимости ее поверхности. Ее поверхность покрыта плотно расположенными вулканами и множеством кратеров.',
  [ESolarSystemObject.EARTH]:
    'Земля - наш дом. Это третья планета от Солнца и единственная планета в Солнечной системе, на которой известно существование жизни. Земля имеет уникальные условия, которые позволяют развитию жизни благодаря ее атмосфере, воде и умеренным температурам. Ее поверхность состоит из суши и океанов, а разнообразие климатических зон обеспечивает множество экосистем и видов живых организмов.',
  [ESolarSystemObject.MARS]:
    'Марс, четвертая планета от Солнца, часто называют "Красной планетой" из-за цвета его поверхности. Марс имеет атмосферу, состоящую преимущественно из углекислого газа, и его поверхность содержит огромные горы, долины, каньоны и высохшие реки, что свидетельствует о прошлом существовании воды на планете. На Марсе также находится самая высокая гора в Солнечной системе, Олимп, и самая большая долина, Валлис Маринерис.',
  [ESolarSystemObject.JUPITER]:
    'Юпитер - крупнейшая планета в Солнечной системе. Он является газовым гигантом, состоящим в основном из водорода и гелия. Юпитер обладает мощным магнитным полем и большим количеством спутников, включая крупнейший спутник в Солнечной системе, Ганимед. Его атмосфера имеет характерные полосы и вихри, включая крупнейший вихрь в виде Большого Красного Пятна, который существует уже более 300 лет.',
  [ESolarSystemObject.SATURN]:
    'Сатурн - вторая крупнейшая планета в Солнечной системе и известен своими красивыми колец. Эти кольца состоят изо льда, камней и других материалов. Сатурн также является газовым гигантом, подобно Юпитеру, и обладает множеством спутников, включая Титан, который обладает плотной атмосферой и жидкими озерами из метана и этилена.',
  [ESolarSystemObject.URANUS]:
    'Уран - седьмая планета от Солнца и газовый гигант, который отличается своим наклоном оси вращения более чем на 90 градусов, что приводит к тому, что Уран вращается на боку, а не вертикально, как другие планеты. Уран имеет кольца, подобные Сатурну, хотя они гораздо менее яркие и тонкие. Спутники Урана также интересны своими необычными орбитами и поведением.',
  [ESolarSystemObject.NEPTUNE]:
    'Нептун - самая дальняя планета от Солнца в Солнечной системе. Это также газовый гигант, подобный Юпитеру и Сатурну. Нептун имеет бурную атмосферу с сильными ветрами и температурами, плавающими около -200 градусов Цельсия. Эта планета имеет несколько спутников и кольца, хотя они гораздо менее известны, чем кольца Сатурна.',
  [ESolarSystemObject.COMET]:
    'Кометы - это космические объекты, состоящие в основном из льда, пыли и камней. Они имеют эллиптические орбиты вокруг Солнца и могут становиться видимыми на небе, когда они приближаются к Солнцу и начинают испаряться, образуя кому. Кометы могут проходить через внутренние области Солнечной системы, где их яркие хвосты могут быть видны невооруженным глазом с Земли. Некоторые кометы имеют периодические орбиты, возвращаясь в нашу область Солнечной системы через многие годы или десятилетия.',
  [ESolarSystemObject.ASTEROID]:
    'Пояс астероидов - область в Солнечной системе, расположенная между орбитами Марса и Юпитера, где находится огромное количество астероидов, небольших космических объектов, состоящих в основном из камня и металла. Этот пояс содержит множество астероидов различных размеров, от крупных до крошечных. Некоторые из них имеют собственные спутники и могут быть источником метеоритов, которые иногда попадают на Землю.',
};
